
name: "priority_queue_ensemble"
platform: "ensemble"

input [
  {
    name: "INPUT0"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]

output [
  {
    name: "OUTPUT0"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "priority_queue"
      model_version: -1
      input_map {
        key: "INPUT0"
        value: "INPUT0"
      },
      output_map {
        key: "OUTPUT0"
        value: "OUTPUT0"
      }
    }
  ]
}

parameters: {
  key: "FORCE_CPU_ONLY_INPUT_TENSORS"
  value:{string_value:"no"}
}